Tekla Open API Reference for Tekla Structures 2025
Size Constructor (Double, Double)
 Creates a new size instance with the specified width and height.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Size(
	double Width,
	double Height
)
Public Sub New (
	Width As Double,
	Height As Double
)
Parameters
Width
Type: System.Double
The width to be used.
Height
Type: System.Double
The height to be used.
See Also
Reference
Size Class
Size Overload
Tekla.Structures.Drawing Namespace